# SQL for Analyst 3 - Aggregation

In [1]:
# set MySQL URL
user = "dz3vg"
password = ""
host = "localhost"
port = 3306
dbname = "dataapplab_db"
with open("MySQL.key", "r") as file:
    password = file.read()
connection_string = f"mysql+mysqlconnector://{user}:{password}@{host}:{port}/{dbname}"

# connect to MySQL server
%load_ext sql
%sql $connection_string

# clean password
password = ""
connection_string = ""

In [2]:
%sql use dalba;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.

[]

In [3]:
%%sql

select
    count(product_id), 
    count(distinct product_id), 
    count(distinct price), 
    count(distinct sales_status)
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(6, 6, 5, 2)]

In [4]:
%%sql

select
    min(price) as min_msrp, 
    max(price) as max_msrp, 
    sum(price) as total_msrp, 
    count(product_id) as num_products
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(Decimal('27.00'), Decimal('999.00'), Decimal('1223.00'), 6)]

In [5]:
%%sql

select
    any_value(product_name), 
    sales_status, 
    count(distinct product_id), 
    sum(price)
from
    products
group by sales_status
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[('XiangLaJiTuiBaoRenQiCanA', 'NEW', 5, Decimal('224.00')),
 ('GuoQiTaoCan', 'DEPRECATED', 1, Decimal('999.00'))]

In [6]:
%%sql

select
    group_concat(distinct product_name separator " ~~~ "), 
    sales_status, 
    count(distinct product_id), 
    sum(price) 
from
    products
group by sales_status
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[('ChaoJiTaKeWuCanTaoCan ~~~ HaiTaiYanShaoDaJiTuiFanTaoCanA2 ~~~ XiangLaJiTuiBaoRenQiCanA ~~~ XiaRiBinFenTong ~~~ XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', 'NEW', 5, Decimal('224.00')),
 ('GuoQiTaoCan', 'DEPRECATED', 1, Decimal('999.00'))]

In [7]:
%%sql

select
    sales_status, 
    price, 
    group_concat(distinct product_name 
                 order by price asc 
                 separator " >>> ") as product_names, 
    count(*)
from
    products
group by sales_status, price
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
5 rows affected.

[('NEW', Decimal('27.00'), 'ChaoJiTaKeWuCanTaoCan', 1),
 ('NEW', Decimal('36.00'), 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB >>> XiangLaJiTuiBaoRenQiCanA', 2),
 ('NEW', Decimal('37.00'), 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', 1),
 ('NEW', Decimal('88.00'), 'XiaRiBinFenTong', 1),
 ('DEPRECATED', Decimal('999.00'), 'GuoQiTaoCan', 1)]

In [8]:
%%sql

select
    create_date, 
    sum(price)
from
    products
group by create_date
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
5 rows affected.

[(datetime.datetime(2014, 11, 20, 8, 20), Decimal('36.00')),
 (datetime.datetime(2014, 12, 20, 8, 20), Decimal('37.00')),
 (datetime.datetime(2016, 11, 20, 10, 20), Decimal('124.00')),
 (datetime.datetime(2018, 11, 20, 10, 20), Decimal('999.00')),
 (datetime.datetime(2020, 8, 14, 0, 14, 27), Decimal('27.00'))]